 // задание 1: кофейный автомат 

void main(){
  String token = '6';
    
    print ('Выберите кофе:');
    print ('1 - Эспрессо');
    print ('2 - Американо');
    print ('3 - Капучино');
    print ('4 - Латте');
    print ('5 - Мокка');
    print ('6 - Горячий шоколад');

    switch (token) {
      case '1':
      print ('Вы  выбрали: Эспрессо');
      print ('Цена: 100 сом');
      print ('Приготовление кофе...');
      print ('Ваш эспрессо готов!');
      break;

      case '2':
      print('Вы выбрали: Американо');
      print('Цена: 120 сом');
      print('Приготовление кофе...');
      print('Ваш американо готов!');
      break;

      case '3':
      print ('Вы выбрали: Капучино');
      print ('Цена: 150 сом');
      print('Приготовление кофе...');
      print('Ваш капучино готов!');
      break;

      case '4':
      print ('Вы выбрали: Латте');
      print ('Цена: 160 сом');
      print('Приготовление кофе...');
      print('Ваш латте готов!');
      break;
      
      case '5':
      print ('Вы выбрали: Мокка');
      print ('Цена: 180 сом');
      print('Приготовление кофе...');
      print('Ваш мокка готов!');
      break;
      
      case'6':
      print ('Вы выбрали: Горячий щоколад');
      print ('Цена: 130 сом');
      print('Приготовление напитка...');
      print('Ваш напиток готов!');
      break;

      default:
      print ('Ошибка! Такого жетона нет.');
      break;

    }
    print ('Спасибо за покупку!');
    print ('Хорошего дня!');
}